{
  "pageProps": {
    "post": {
      "mdxSource": "var Component=(()=>{var l=Object.create;var o=Object.defineProperty;var d=Object.getOwnPropertyDescriptor;var c=Object.getOwnPropertyNames;var m=Object.getPrototypeOf,u=Object.prototype.hasOwnProperty;var r=a=>o(a,\"__esModule\",{value:!0});var y=(a,i)=>()=>(i||a((i={exports:{}}).exports,i),i.exports),p=(a,i)=>{r(a);for(var n in i)o(a,n,{get:i[n],enumerable:!0})},f=(a,i,n)=>{if(i&&typeof i==\"object\"||typeof i==\"function\")for(let t of c(i))!u.call(a,t)&&t!==\"default\"&&o(a,t,{get:()=>i[t],enumerable:!(n=d(i,t))||n.enumerable});return a},g=a=>f(r(o(a!=null?l(m(a)):{},\"default\",a&&a.__esModule&&\"default\"in a?{get:()=>a.default,enumerable:!0}:{value:a,enumerable:!0})),a);var s=y((x,h)=>{h.exports=_jsx_runtime});var T={};p(T,{default:()=>b,frontmatter:()=>w});var e=g(s()),w={title:\"The Time Machine\",date:\"2018-08-15\",tags:[\"writings\",\"book\",\"reflection\"],draft:!1,summary:\"The Time Traveller (for so it will be convenient to speak of him) was expounding a recondite matter to us. His pale grey eyes shone and twinkled, and his usually pale face was flushed and animated...\"};function v(a={}){let{wrapper:i}=a.components||{};return i?(0,e.jsx)(i,Object.assign({},a,{children:(0,e.jsx)(n,{})})):n();function n(){let t=Object.assign({h1:\"h1\",a:\"a\",span:\"span\",p:\"p\",em:\"em\",h2:\"h2\"},a.components);return(0,e.jsxs)(e.Fragment,{children:[(0,e.jsxs)(t.h1,{id:\"the-time-machine-by-h-g-wells\",children:[(0,e.jsx)(t.a,{href:\"#the-time-machine-by-h-g-wells\",\"aria-hidden\":\"true\",tabIndex:\"-1\",children:(0,e.jsx)(t.span,{className:\"icon icon-link\"})}),\"The Time Machine by H. G. Wells\"]}),(0,e.jsxs)(t.p,{children:[(0,e.jsx)(t.em,{children:\"Title\"}),\": The Time Machine\"]}),(0,e.jsxs)(t.p,{children:[(0,e.jsx)(t.em,{children:\"Author\"}),\": H. G. Wells\"]}),(0,e.jsxs)(t.p,{children:[(0,e.jsx)(t.em,{children:\"Subject\"}),\": Science Fiction\"]}),(0,e.jsxs)(t.p,{children:[(0,e.jsx)(t.em,{children:\"Language\"}),\": English\"]}),(0,e.jsxs)(t.p,{children:[(0,e.jsx)(t.em,{children:\"Source\"}),\": \",(0,e.jsx)(t.a,{href:\"https://www.gutenberg.org/ebooks/35\",children:\"Project Gutenberg\"})]}),(0,e.jsxs)(t.h2,{id:\"introduction\",children:[(0,e.jsx)(t.a,{href:\"#introduction\",\"aria-hidden\":\"true\",tabIndex:\"-1\",children:(0,e.jsx)(t.span,{className:\"icon icon-link\"})}),\"Introduction\"]}),(0,e.jsx)(t.p,{children:\"The Time Traveller (for so it will be convenient to speak of him) was expounding a recondite matter to us. His pale grey eyes shone and twinkled, and his usually pale face was flushed and animated. The fire burnt brightly, and the soft radiance of the incandescent lights in the lilies of silver caught the bubbles that flashed and passed in our glasses. Our chairs, being his patents, embraced and caressed us rather than submitted to be sat upon, and there was that luxurious after-dinner atmosphere, when thought runs gracefully free of the trammels of precision. And he put it to us in this way\\u2014marking the points with a lean forefinger\\u2014as we sat and lazily admired his earnestness over this new paradox (as we thought it) and his fecundity.\"}),(0,e.jsx)(t.p,{children:\"\\u201CYou must follow me carefully. I shall have to controvert one or two ideas that are almost universally accepted. The geometry, for instance, they taught you at school is founded on a misconception.\\u201D\"}),(0,e.jsx)(t.p,{children:\"\\u201CIs not that rather a large thing to expect us to begin upon?\\u201D said Filby, an argumentative person with red hair.\"}),(0,e.jsxs)(t.p,{children:[\"\\u201CI do not mean to ask you to accept anything without reasonable ground for it. You will soon admit as much as I need from you. You know of course that a mathematical line, a line of thickness \",(0,e.jsx)(t.em,{children:\"nil\"}),\", has no real existence. They taught you that? Neither has a mathematical plane. These things are mere abstractions.\\u201D\"]}),(0,e.jsx)(t.p,{children:\"\\u201CThat is all right,\\u201D said the Psychologist.\"}),(0,e.jsx)(t.p,{children:\"\\u201CNor, having only length, breadth, and thickness, can a cube have a real existence.\\u201D\"}),(0,e.jsx)(t.p,{children:\"\\u201CThere I object,\\u201D said Filby. \\u201COf course a solid body may exist. All real things\\u2014\\u201D\"}),(0,e.jsxs)(t.p,{children:[\"\\u201CSo most people think. But wait a moment. Can an \",(0,e.jsx)(t.em,{children:\"instantaneous\"}),\" cube exist?\\u201D\"]}),(0,e.jsx)(t.p,{children:\"\\u201CDon\\u2019t follow you,\\u201D said Filby.\"}),(0,e.jsx)(t.p,{children:\"\\u201CCan a cube that does not last for any time at all, have a real existence?\\u201D\"}),(0,e.jsxs)(t.p,{children:[\"Filby became pensive. \\u201CClearly,\\u201D the Time Traveller proceeded, \\u201Cany real body must have extension in \",(0,e.jsx)(t.em,{children:\"four\"}),\" directions: it must have Length, Breadth, Thickness, and\\u2014Duration. But through a natural infirmity of the flesh, which I will explain to you in a moment, we incline to overlook this fact. There are really four dimensions, three which we call the three planes of Space, and a fourth, Time. There is, however, a tendency to draw an unreal distinction between the former three dimensions and the latter, because it happens that our consciousness moves intermittently in one direction along the latter from the beginning to the end of our lives.\\u201D\"]}),(0,e.jsx)(t.p,{children:\"\\u201CThat,\\u201D said a very young man, making spasmodic efforts to relight his cigar over the lamp; \\u201Cthat . . . very clear indeed.\\u201D\"}),(0,e.jsxs)(t.p,{children:[\"\\u201CNow, it is very remarkable that this is so extensively overlooked,\\u201D continued the Time Traveller, with a slight accession of cheerfulness. \\u201CReally this is what is meant by the Fourth Dimension, though some people who talk about the Fourth Dimension do not know they mean it. It is only another way of looking at Time. \",(0,e.jsx)(t.em,{children:\"There is no difference between Time and any of the three dimensions of Space except that our consciousness moves along it\"}),\". But some foolish people have got hold of the wrong side of that idea. You have all heard what they have to say about this Fourth Dimension?\\u201D\"]}),(0,e.jsxs)(t.p,{children:[\"\\u201C\",(0,e.jsx)(t.em,{children:\"I\"}),\" have not,\\u201D said the Provincial Mayor.\"]}),(0,e.jsxs)(t.p,{children:[\"\\u201CIt is simply this. That Space, as our mathematicians have it, is spoken of as having three dimensions, which one may call Length, Breadth, and Thickness, and is always definable by reference to three planes, each at right angles to the others. But some philosophical people have been asking why \",(0,e.jsx)(t.em,{children:\"three\"}),\" dimensions particularly\\u2014why not another direction at right angles to the other three?\\u2014and have even tried to construct a Four-Dimensional geometry. Professor Simon Newcomb was expounding this to the New York Mathematical Society only a month or so ago. You know how on a flat surface, which has only two dimensions, we can represent a figure of a three-dimensional solid, and similarly they think that by models of three dimensions they could represent one of four\\u2014if they could master the perspective of the thing. See?\\u201D\"]}),(0,e.jsx)(t.p,{children:\"\\u201CI think so,\\u201D murmured the Provincial Mayor; and, knitting his brows, he lapsed into an introspective state, his lips moving as one who repeats mystic words. \\u201CYes, I think I see it now,\\u201D he said after some time, brightening in a quite transitory manner.\"}),(0,e.jsx)(t.p,{children:\"\\u201CWell, I do not mind telling you I have been at work upon this geometry of Four Dimensions for some time. Some of my results are curious. For instance, here is a portrait of a man at eight years old, another at fifteen, another at seventeen, another at twenty-three, and so on. All these are evidently sections, as it were, Three-Dimensional representations of his Four-Dimensioned being, which is a fixed and unalterable thing.\"}),(0,e.jsx)(t.p,{children:\"\\u201CScientific people,\\u201D proceeded the Time Traveller, after the pause required for the proper assimilation of this, \\u201Cknow very well that Time is only a kind of Space. Here is a popular scientific diagram, a weather record. This line I trace with my finger shows the movement of the barometer. Yesterday it was so high, yesterday night it fell, then this morning it rose again, and so gently upward to here. Surely the mercury did not trace this line in any of the dimensions of Space generally recognised? But certainly it traced such a line, and that line, therefore, we must conclude, was along the Time-Dimension.\\u201D\"}),(0,e.jsx)(t.p,{children:\"\\u201CBut,\\u201D said the Medical Man, staring hard at a coal in the fire, \\u201Cif Time is really only a fourth dimension of Space, why is it, and why has it always been, regarded as something different? And why cannot we move in Time as we move about in the other dimensions of Space?\\u201D\"}),(0,e.jsx)(t.p,{children:\"The Time Traveller smiled. \\u201CAre you so sure we can move freely in Space? Right and left we can go, backward and forward freely enough, and men always have done so. I admit we move freely in two dimensions. But how about up and down? Gravitation limits us there.\\u201D\"}),(0,e.jsx)(t.p,{children:\"\\u201CNot exactly,\\u201D said the Medical Man. \\u201CThere are balloons.\\u201D\"}),(0,e.jsx)(t.p,{children:\"\\u201CBut before the balloons, save for spasmodic jumping and the inequalities of the surface, man had no freedom of vertical movement.\\u201D\"}),(0,e.jsx)(t.p,{children:\"\\u201CStill they could move a little up and down,\\u201D said the Medical Man.\"}),(0,e.jsx)(t.p,{children:\"\\u201CEasier, far easier down than up.\\u201D\"}),(0,e.jsx)(t.p,{children:\"\\u201CAnd you cannot move at all in Time, you cannot get away from the present moment.\\u201D\"}),(0,e.jsxs)(t.p,{children:[\"\\u201CMy dear sir, that is just where you are wrong. That is just where the whole world has gone wrong. We are always getting away from the present moment. Our mental existences, which are immaterial and have no dimensions, are passing along the Time-Dimension with a uniform velocity from the cradle to the grave. Just as we should travel \",(0,e.jsx)(t.em,{children:\"down\"}),\" if we began our existence fifty miles above the earth\\u2019s surface.\\u201D\"]}),(0,e.jsxs)(t.p,{children:[\"\\u201CBut the great difficulty is this,\\u201D interrupted the Psychologist. \\u2019You \",(0,e.jsx)(t.em,{children:\"can\"}),\" move about in all directions of Space, but you cannot move about in Time.\\u201D\"]}),(0,e.jsx)(t.p,{children:\"\\u201CThat is the germ of my great discovery. But you are wrong to say that we cannot move about in Time. For instance, if I am recalling an incident very vividly I go back to the instant of its occurrence: I become absent-minded, as you say. I jump back for a moment. Of course we have no means of staying back for any length of Time, any more than a savage or an animal has of staying six feet above the ground. But a civilised man is better off than the savage in this respect. He can go up against gravitation in a balloon, and why should he not hope that ultimately he may be able to stop or accelerate his drift along the Time-Dimension, or even turn about and travel the other way?\\u201D\"}),(0,e.jsxs)(t.p,{children:[\"\\u201COh, \",(0,e.jsx)(t.em,{children:\"this\"}),\",\\u201D began Filby, \\u201Cis all\\u2014\\u201D\"]}),(0,e.jsx)(t.p,{children:\"\\u201CWhy not?\\u201D said the Time Traveller.\"}),(0,e.jsx)(t.p,{children:\"\\u201CIt\\u2019s against reason,\\u201D said Filby.\"}),(0,e.jsx)(t.p,{children:\"\\u201CWhat reason?\\u201D said the Time Traveller.\"}),(0,e.jsx)(t.p,{children:\"\\u201CYou can show black is white by argument,\\u201D said Filby, \\u201Cbut you will never convince me.\\u201D\"}),(0,e.jsx)(t.p,{children:\"\\u201CPossibly not,\\u201D said the Time Traveller. \\u201CBut now you begin to see the object of my investigations into the geometry of Four Dimensions. Long ago I had a vague inkling of a machine\\u2014\\u201D\"}),(0,e.jsx)(t.p,{children:\"\\u201CTo travel through Time!\\u201D exclaimed the Very Young Man.\"}),(0,e.jsx)(t.p,{children:\"\\u201CThat shall travel indifferently in any direction of Space and Time, as the driver determines.\\u201D\"}),(0,e.jsx)(t.p,{children:\"Filby contented himself with laughter.\"}),(0,e.jsx)(t.p,{children:\"\\u201CBut I have experimental verification,\\u201D said the Time Traveller.\"}),(0,e.jsx)(t.p,{children:\"\\u201CIt would be remarkably convenient for the historian,\\u201D the Psychologist suggested. \\u201COne might travel back and verify the accepted account of the Battle of Hastings, for instance!\\u201D\"}),(0,e.jsx)(t.p,{children:\"\\u201CDon\\u2019t you think you would attract attention?\\u201D said the Medical Man. \\u201COur ancestors had no great tolerance for anachronisms.\\u201D\"}),(0,e.jsx)(t.p,{children:\"\\u201COne might get one\\u2019s Greek from the very lips of Homer and Plato,\\u201D the Very Young Man thought.\"}),(0,e.jsx)(t.p,{children:\"\\u201CIn which case they would certainly plough you for the Little-go. The German scholars have improved Greek so much.\\u201D\"}),(0,e.jsx)(t.p,{children:\"\\u201CThen there is the future,\\u201D said the Very Young Man. \\u201CJust think! One might invest all one\\u2019s money, leave it to accumulate at interest, and hurry on ahead!\\u201D\"}),(0,e.jsx)(t.p,{children:\"\\u201CTo discover a society,\\u201D said I, \\u201Cerected on a strictly communistic basis.\\u201D\"}),(0,e.jsx)(t.p,{children:\"\\u201COf all the wild extravagant theories!\\u201D began the Psychologist.\"}),(0,e.jsx)(t.p,{children:\"\\u201CYes, so it seemed to me, and so I never talked of it until\\u2014\\u201D\"}),(0,e.jsxs)(t.p,{children:[\"\\u201CExperimental verification!\\u201D cried I. \\u201CYou are going to verify \",(0,e.jsx)(t.em,{children:\"that\"}),\"?\\u201D\"]}),(0,e.jsx)(t.p,{children:\"\\u201CThe experiment!\\u201D cried Filby, who was getting brain-weary.\"}),(0,e.jsx)(t.p,{children:\"\\u201CLet\\u2019s see your experiment anyhow,\\u201D said the Psychologist, \\u201Cthough it\\u2019s all humbug, you know.\\u201D\"}),(0,e.jsx)(t.p,{children:\"The Time Traveller smiled round at us. Then, still smiling faintly, and with his hands deep in his trousers pockets, he walked slowly out of the room, and we heard his slippers shuffling down the long passage to his laboratory.\"}),(0,e.jsx)(t.p,{children:\"The Psychologist looked at us. \\u201CI wonder what he\\u2019s got?\\u201D\"}),(0,e.jsx)(t.p,{children:\"\\u201CSome sleight-of-hand trick or other,\\u201D said the Medical Man, and Filby tried to tell us about a conjuror he had seen at Burslem, but before he had finished his preface the Time Traveller came back, and Filby\\u2019s anecdote collapsed.\"})]})}}var b=v;return T;})();\n;return Component;",
      "toc": [
        {
          "value": "The Time Machine by H. G. Wells",
          "url": "#the-time-machine-by-h-g-wells",
          "depth": 1
        },
        { "value": "Introduction", "url": "#introduction", "depth": 2 }
      ],
      "frontMatter": {
        "readingTime": { "text": "9 min read", "minutes": 8.57, "time": 514200, "words": 1714 },
        "slug": "the-time-machine",
        "fileName": "the-time-machine.mdx",
        "title": "The Time Machine",
        "date": "2018-08-15T00:00:00.000Z",
        "tags": ["writings", "book", "reflection"],
        "draft": false,
        "summary": "The Time Traveller (for so it will be convenient to speak of him) was expounding a recondite matter to us. His pale grey eyes shone and twinkled, and his usually pale face was flushed and animated..."
      }
    },
    "authorDetails": [
      {
        "readingTime": { "text": "1 min read", "minutes": 0.61, "time": 36600, "words": 122 },
        "slug": ["default"],
        "fileName": "default.md",
        "name": "Tails Azimuth",
        "avatar": "/static/images/avatar.png",
        "occupation": "Professor of Atmospheric Science",
        "company": "Stanford University",
        "email": "address@yoursite.com",
        "twitter": "https://twitter.com/Twitter",
        "linkedin": "https://www.linkedin.com",
        "github": "https://github.com",
        "date": null
      }
    ],
    "prev": {
      "title": "O Canada",
      "date": "2017-07-15T00:00:00.000Z",
      "tags": ["holiday", "canada", "images"],
      "draft": false,
      "summary": "The scenic lands of Canada featuring maple leaves, snow-capped mountains, turquoise lakes and Toronto. Take in the sights in this photo gallery exhibition and see how easy it is to replicate with some MDX magic and tailwind classes.",
      "slug": "pictures-of-canada"
    },
    "next": {
      "title": "Markdown Guide",
      "date": "2019-10-11T00:00:00.000Z",
      "tags": ["github", "guide"],
      "draft": false,
      "summary": "Markdown cheatsheet for all your blogging needs - headers, lists, images, tables and more! An illustrated guide based on GitHub Flavored Markdown.",
      "slug": "github-markdown-guide"
    }
  },
  "__N_SSG": true
}
